# EditScope Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EditScope Class
Members See Also
---
The base class for a scope object that provides special access and limitations related to editing certain elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class EditScope : IDisposable
```

Visual Basic
---
```text
Public Class EditScope _
	Implements IDisposable
```

Visual C++
---
```text
public ref class EditScope : IDisposable
```

# Remarks
Derivations of this class provide specific functionality to manage edit modes for specific purposes.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..EditScope Autodesk.Revit.DB.Architecture..::..TopographyEditScope Autodesk.Revit.DB..::..SketchEditScope Autodesk.Revit.DB..::..StairsEditScope
# See Also
EditScope Members
Autodesk.Revit.DB Namespace